app/controllers/questions_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @question = Question.includes(:answers, :comments).find(params[:id])